{
  "additional_special_tokens": [
    "▁<PRE>",
    "▁<MID>",
    "▁<SUF>",
    "▁<EOT>",
    "▁<PRE>",
    "▁<MID>",
    "▁<SUF>",
    "▁<EOT>"
  ],
  "bos_token": {
    "content": "<s>",
    "lstrip": true,
    "normalized": false,
    "rstrip": true,
    "single_word": false
  },
  "eos_token": {
    "content": "</s>",
    "lstrip": true,
    "normalized": false,
    "rstrip": true,
    "single_word": false
  },
  "pad_token": "</s>",
  "unk_token": {
    "content": "<unk>",
    "lstrip": true,
    "normalized": false,
    "rstrip": true,
    "single_word": false
  }
}
